
Feature: Регистриране на резервация

  Scenario: Валидна резервация
    Given Потребителя отваря екрана за резервации
    When Потребителя въвежда данните си
    And Избира филм "Inception" , "11"
    And Прави резервацията в "10"
    Then Виждаме съобщение "Success"
    
  Scenario: Невалидна резервация защото не е направена 60 мин преди филм
    Given Потребителя отваря екрана за резервации
    When Потребителя въвежда данните си
    And Избира филм "Inception" , "11"
    And Прави резервацията в "11"
    Then Виждаме съобщение "Invalid reservation time need to be 60 min before film"
    
 Scenario: Невалидна резервация с невалиден час на филм
    Given Потребителя отваря екрана за резервации
    When Потребителя въвежда данните си
    And Избира филм "Inception" , "12"
    And Прави резервацията в "10"
    Then Виждаме съобщение "Invalid film name or time"
		
		Scenario: Невалидна резервация с невалидно име на филм
    Given Потребителя отваря екрана за резервации
    When Потребителя въвежда данните си
    And Избира филм "Incaption" , "11"
    And Прави резервацията в "10"
    Then Виждаме съобщение "Invalid film name or time"
    
    	Scenario: Невалидна резервация
    Given Потребителя отваря екрана за резервации
    When Потребителя въвежда данните си
    And Избира филм "" , ""
    And Прави резервацията в "10"
    Then Виждаме съобщение "Invalid data"
		
